{"id":"1","title":"Safety and immunogenicity of an optimized self-replicating RNA platform for low dose or single dose vaccine applications: a randomized, open label Phase I study in healthy volunteers","authors":"Aliahmad P, et al.","journal":"Nature Communications","year":"2025","doi":"10.1038/s41467-025-55843-9","url":"https://www.nature.com/articles/s41467-025-55843-9","keyPoints":"Self-replicating RNA (srRNA) shows 1,000,000-fold dose reduction vs mRNA; 0.1-10μg doses achieve protective immunity; No serious adverse events reported","keyHypotheses":"srRNA technology provides superior dose-sparing and durability vs conventional mRNA vaccines","strengths":"First-in-human validation of ultra-low dose RNA vaccine; Comprehensive dose-response characterization; Strong safety profile","weaknesses":"Limited to human studies; No veterinary species data; Single antigen system tested","citation":"Aliahmad P, et al. Safety and immunogenicity of an optimized self-replicating RNA platform for low dose or single dose vaccine applications. Nature Communications. 2025;16:343.","notes":"Breakthrough paper demonstrating potential for ultra-low dose RNA vaccines - critical for large animal applications","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"2","title":"A simple practice guide for dose conversion between animals and human","authors":"Nair AB, Jacob S","journal":"Journal of Basic and Clinical Pharmacy","year":"2016","doi":"10.4103/0976-0105.177703","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC4804402/","keyPoints":"Body surface area scaling more accurate than mg/kg for interspecies dose conversion; Provides conversion factors for common species; Validated methodology for pharmaceutical development","keyHypotheses":"Allometric scaling based on body surface area normalization provides superior dose translation between species","strengths":"Practical conversion tables; Extensive validation data; Widely cited reference standard","weaknesses":"Derived primarily from small-molecule drug data; Limited biological therapeutics validation; No RNA-specific considerations","citation":"Nair AB, Jacob S. A simple practice guide for dose conversion between animals and human. J Basic Clin Pharm. 2016;7(2):27-31.","notes":"Foundational scaling methodology - needs validation for RNA therapeutics","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"3","title":"To scale or not to scale: the principles of dose extrapolation","authors":"Sharma V, McNeill JH","journal":"British Journal of Pharmacology","year":"2009","doi":"10.1111/j.1476-5381.2009.00267.x","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC2737649/","keyPoints":"Critical analysis of allometric scaling assumptions; Identification of drugs unsuitable for simple scaling; Recommendations for complex biologics","keyHypotheses":"Simple allometric scaling fails for drugs with complex pharmacokinetics, metabolism, or protein binding","strengths":"Comprehensive theoretical framework; Identifies limitations of current approaches; Practical guidance for complex therapeutics","weaknesses":"Pre-dates RNA therapeutics era; Limited experimental validation in large animals; Focus on small molecules","citation":"Sharma V, McNeill JH. To scale or not to scale: the principles of dose extrapolation. Br J Pharmacol. 2009;157(6):907-921.","notes":"Essential reading for understanding scaling limitations - highly relevant to RNA vaccine complexity","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"4","title":"Pharmacokinetics of amoxicillin trihydrate in male Asian elephants following intramuscular administration","authors":"Sinphithakkul P, et al.","journal":"Journal of Veterinary Pharmacology and Therapeutics","year":"2015","doi":"10.1111/jvp.12265","url":"https://onlinelibrary.wiley.com/doi/10.1111/jvp.12265","keyPoints":"First pharmacokinetic study in elephants (2-6 ton body weight); 5.5 mg/kg dose achieves therapeutic levels for 24h; Body weight-based dosing validation in mega-fauna","keyHypotheses":"Conventional mg/kg dosing approaches can be validated in extremely large animals through pharmacokinetic studies","strengths":"First-of-kind mega-fauna pharmacokinetic study; Practical dosing recommendations; Species-specific parameter determination","weaknesses":"Single drug studied; Limited to antimicrobials; No comparison with allometric predictions","citation":"Sinphithakkul P, et al. Pharmacokinetics of amoxicillin trihydrate in male Asian elephants (Elephas maximus) following intramuscular administration. J Vet Pharmacol Ther. 2015;38(4):374-378.","notes":"Proof-of-concept for pharmacokinetic studies in largest land mammals - critical precedent for RNA vaccine research","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"5","title":"Penn Vet Announces mRNA Research Initiative to Advance Veterinary Vaccine Science","authors":"Penn Veterinary Medicine","journal":"University of Pennsylvania Press Release","year":"2023","doi":"N/A","url":"https://www.vet.upenn.edu/penn-vet-announces-mrna-research-initiative-to-advance-veterinary-vaccine-science-2/","keyPoints":"First veterinary-focused mRNA vaccine research initiative; Focus on barrier immunity and T-cell responses; Species-specific optimization approaches","keyHypotheses":"mRNA vaccines require veterinary-specific development to address unique physiological and immunological requirements","strengths":"Dedicated veterinary focus; Institutional commitment; Collaborative framework","weaknesses":"Early-stage initiative; Limited published data; No specific dosing studies yet","citation":"Penn Veterinary Medicine. Penn Vet Announces mRNA Research Initiative to Advance Veterinary Vaccine Science. 2023.","notes":"Institutional recognition of need for veterinary-specific RNA vaccine development","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"6","title":"Study: mRNA Vaccine Provides Better Rotavirus Protection in Foals","authors":"Vigouroux L","journal":"The Horse","year":"2025","doi":"N/A","url":"https://thehorse.com/1134035/study-mrna-vaccine-provides-better-rotavirus-protection-in-foals/","keyPoints":"mRNA rotavirus vaccine superior to conventional vaccines in foals; Species-specific immunogenicity demonstrated; Potential for improved equine vaccination protocols","keyHypotheses":"mRNA vaccines can provide superior protection vs conventional vaccines in equine species","strengths":"Species-specific validation; Comparative efficacy data; Practical veterinary application","weaknesses":"Single pathogen focus; Limited dosing information; Pre-publication data","citation":"Vigouroux L. Study: mRNA Vaccine Provides Better Rotavirus Protection in Foals. The Horse. 2025.","notes":"First equine mRNA vaccine efficacy data - validates species-specific potential","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"7","title":"Safety and efficacy assessment of an mRNA rabies vaccine in dogs, rodents, and cynomolgus macaques","authors":"Peng Y, et al.","journal":"npj Vaccines","year":"2024","doi":"10.1038/s41541-024-00925-w","url":"https://www.nature.com/articles/s41541-024-00925-w","keyPoints":"Multi-species mRNA rabies vaccine evaluation; Safety and efficacy in dogs and non-human primates; Dose-response relationships across species","keyHypotheses":"mRNA rabies vaccines can provide cross-species protection with appropriate dose optimization","strengths":"Multi-species validation; Comprehensive safety assessment; Practical veterinary pathogen","weaknesses":"Limited large animal data; No allometric scaling analysis; Single vaccine platform","citation":"Peng Y, et al. Safety and efficacy assessment of an mRNA rabies vaccine in dogs, rodents, and cynomolgus macaques. npj Vaccines. 2024;9:125.","notes":"Important multi-species mRNA vaccine study - supports cross-species applicability","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"8","title":"A spike-based mRNA vaccine that induces durable and broad protection against porcine deltacoronavirus in piglets","authors":"Li B, et al.","journal":"Journal of Virology","year":"2024","doi":"10.1128/jvi.00535-24","url":"https://journals.asm.org/doi/10.1128/jvi.00535-24","keyPoints":"Species-specific mRNA vaccine optimization in pigs; Superior protection vs inactivated vaccines; Dose-dependent immunogenicity demonstrated","keyHypotheses":"mRNA vaccines require species-specific optimization for optimal immunogenicity in target veterinary species","strengths":"Species-specific optimization; Comparative vaccine platform analysis; Production animal focus","weaknesses":"Single species studied; Limited dose range exploration; No scaling methodology","citation":"Li B, et al. A spike-based mRNA vaccine that induces durable and broad protection against porcine deltacoronavirus in piglets. J Virol. 2024;98(17):e00535-24.","notes":"Demonstrates need for species-specific mRNA vaccine optimization in production animals","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"9","title":"Application of allometric principles for the prediction of pharmacokinetics in human and veterinary drug development","authors":"Mahmood I","journal":"Advanced Drug Delivery Reviews","year":"2007","doi":"10.1016/j.addr.2007.05.015","url":"https://www.sciencedirect.com/science/article/pii/S0169409X07001731","keyPoints":"Comprehensive review of allometric scaling in veterinary medicine; Interspecies pharmacokinetic prediction methods; Large animal dosing challenges","keyHypotheses":"Allometric scaling provides useful framework for veterinary drug development despite limitations","strengths":"Veterinary focus; Comprehensive methodology; Large animal considerations","weaknesses":"Pre-RNA therapeutic era; Limited biological validation; Dated references","citation":"Mahmood I. Application of allometric principles for the prediction of pharmacokinetics in human and veterinary drug development. Adv Drug Deliv Rev. 2007;59(11):1177-1192.","notes":"Seminal veterinary pharmacokinetic scaling review - foundation for RNA vaccine applications","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"10","title":"Immune responses of Asian elephants to commercial tetanus toxoid vaccine","authors":"Lindsay WA, et al.","journal":"Vaccine","year":"2010","doi":"10.1016/j.vaccine.2009.11.068","url":"https://www.sciencedirect.com/science/article/pii/S0165242709002578","keyPoints":"Tetanus vaccination produces measurable antibody responses in elephants; Age-related immune response differences; Standard equine doses effective in elephants","keyHypotheses":"Conventional vaccine doses developed for horses can provide effective immunity in elephants despite 10-fold size difference","strengths":"Large animal vaccine validation; Age-stratified analysis; Practical dosing recommendations","weaknesses":"Single vaccine type; No dose-response analysis; Limited mechanistic insights","citation":"Lindsay WA, et al. Immune responses of Asian elephants (Elephas maximus) to commercial tetanus toxoid vaccine. Vaccine. 2010;28(6):1375-1380.","notes":"Demonstrates feasibility of effective vaccination in mega-fauna - supports cross-species vaccine applications","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"11","title":"Does a Smaller Dog Need a Smaller Vaccine?","authors":"Khuly P","journal":"PetMD","year":"2011","doi":"N/A","url":"https://www.petmd.com/blogs/fullyvetted/2011/july/smaller_dog_smaller_vaccine-11432","keyPoints":"Vaccine dose-response relationship inversely related to body weight in dogs; Small dogs have higher adverse event rates; One-size-fits-all vaccine dosing questioned","keyHypotheses":"Current vaccine dosing practices may be suboptimal for small animals due to inverse weight-response relationships","strengths":"Practical clinical observations; Body weight-response correlation; Veterinary practitioner perspective","weaknesses":"Opinion piece format; Limited scientific rigor; Single species focus","citation":"Khuly P. Does a Smaller Dog Need a Smaller Vaccine? PetMD. 2011.","notes":"Important clinical observation of inverse size-response relationship in veterinary vaccines","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"12","title":"Preliminary evaluation of a novel serotype O foot-and-mouth disease mRNA vaccine","authors":"Zhao J, et al.","journal":"Frontiers in Microbiology","year":"2025","doi":"10.3389/fmicb.2025.1503191","url":"https://www.frontiersin.org/journals/microbiology/articles/10.3389/fmicb.2025.1503191/full","keyPoints":"Novel foot-and-mouth disease mRNA vaccine development; Cattle-specific optimization; Advantages over traditional inactivated vaccines","keyHypotheses":"mRNA vaccines can overcome limitations of conventional FMD vaccines through rapid development and improved safety profiles","strengths":"High-impact veterinary pathogen; Cattle-specific development; Novel mRNA platform","weaknesses":"Preliminary evaluation only; Limited dose optimization data; Single serotype focus","citation":"Zhao J, et al. Preliminary evaluation of a novel serotype O foot-and-mouth disease mRNA vaccine. Front Microbiol. 2025;16:1503191.","notes":"Important development in cattle mRNA vaccines for critical veterinary pathogen","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"13","title":"mRNA Vaccine Development for Emerging Animal and Zoonotic Diseases","authors":"Le T, Sun C","journal":"Viruses","year":"2022","doi":"10.3390/v14020401","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC8877136/","keyPoints":"Comprehensive review of veterinary mRNA vaccine development; Focus on zoonotic disease applications; Platform advantages for emerging pathogens","keyHypotheses":"mRNA vaccine platforms provide unique advantages for rapid response to emerging veterinary and zoonotic diseases","strengths":"Comprehensive veterinary focus; Zoonotic disease emphasis; Platform comparison analysis","weaknesses":"Review format only; Limited dosing considerations; No species-specific optimization","citation":"Le T, Sun C. mRNA Vaccine Development for Emerging Animal and Zoonotic Diseases. Viruses. 2022;14(2):401.","notes":"Comprehensive review establishing rationale for veterinary mRNA vaccine development","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"14","title":"Physiological parameter values for physiologically based pharmacokinetic models in food-producing animals. Part I: Cattle and swine","authors":"Lin Z, et al.","journal":"Journal of Veterinary Pharmacology and Therapeutics","year":"2020","doi":"10.1111/jvp.12861","url":"https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/jvp.12861","keyPoints":"Species-specific physiological parameters for cattle and swine PBPK modeling; Comprehensive parameter compilation; Variability characterization within species","keyHypotheses":"PBPK modeling requires accurate species-specific physiological parameters for reliable predictions in veterinary medicine","strengths":"Comprehensive parameter compilation; Species-specific focus; PBPK modeling applications","weaknesses":"Limited to cattle and swine; No RNA therapeutic considerations; Parameter validation challenges","citation":"Lin Z, et al. Physiological parameter values for physiologically based pharmacokinetic models in food-producing animals. Part I: Cattle and swine. J Vet Pharmacol Ther. 2020;43(4):385-420.","notes":"Essential physiological parameter reference for PBPK modeling in veterinary species","addedDate":"2025-10-03T19:36:52.000Z"}
{"id":"15","title":"Controlling reactogenicity while preserving immunogenicity from a self-amplifying RNA vaccine","authors":"Folliard T, et al.","journal":"npj Vaccines","year":"2025","doi":"10.1038/s41541-025-01135-8","url":"https://www.nature.com/articles/s41541-025-01135-8","keyPoints":"saRNA platform optimization to reduce reactogenicity; Nucleocytoplasmic transport modulation; Balance between immunogenicity and safety","keyHypotheses":"saRNA vaccine reactogenicity can be controlled through platform engineering while maintaining immunogenicity","strengths":"Novel platform optimization approach; Safety-immunogenicity balance; Mechanistic insights","weaknesses":"Early-stage development; No veterinary species testing; Limited clinical validation","citation":"Folliard T, et al. Controlling reactogenicity while preserving immunogenicity from a self-amplifying RNA vaccine by modulating nucleocytoplasmic transport. npj Vaccines. 2025;10:78.","notes":"Important platform optimization strategy for improving RNA vaccine therapeutic index","addedDate":"2025-10-03T19:36:52.000Z"}